const hexagonsData = [
        {
            "index": 0,
            "richness": "LUSH",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 0,
                "y": 0,
                "z": 0
            },            
        },
        {
            "index": 1,
            "richness": "LUSH",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 1,
                "y": -1,
                "z": 0
            },
            "tree": {
                "size": 1, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "player": "player1"
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 2,
            "richness": "LUSH",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 1,
                "y": 0,
                "z": -1
            },
            "tree": {
                "size": 2, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "player": "player2"
            } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 3,
            "richness": "LUSH",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 0,
                "y": 1,
                "z": -1
            },
            "tree": {
                "size": 3, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "player": "player2"
            } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 4,
            "richness": "LUSH",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": -1,
                "y": 1,
                "z": 0
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 5,
            "richness": "LUSH",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": -1,
                "y": 0,
                "z": 1
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 6,
            "richness": "LUSH",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 0,
                "y": -1,
                "z": 1
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 7,
            "richness": "OK",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 2,
                "y": -2,
                "z": 0
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 8,
            "richness": "OK",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 2,
                "y": -1,
                "z": -1
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 9,
            "richness": "OK",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 2,
                "y": 0,
                "z": -2
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 10,
            "richness": "OK",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 1,
                "y": 1,
                "z": -2
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 11,
            "richness": "OK",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 0,
                "y": 2,
                "z": -2
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 12,
            "richness": "OK",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": -1,
                "y": 2,
                "z": -1
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 13,
            "richness": "OK",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": -2,
                "y": 2,
                "z": 0
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 14,
            "richness": "OK",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": -2,
                "y": 1,
                "z": 1
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 15,
            "richness": "OK",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": -2,
                "y": 0,
                "z": 2
            }
        },
        {
            "index": 16,
            "richness": "OK",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": -1,
                "y": -1,
                "z": 2
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 17,
            "richness": "OK",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 0,
                "y": -2,
                "z": 2
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 18,
            "richness": "OK",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 1,
                "y": -2,
                "z": 1
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 19,
            "richness": "POOR",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 3,
                "y": -3,
                "z": 0
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 20,
            "richness": "POOR",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 3,
                "y": -2,
                "z": -1
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 21,
            "richness": "POOR",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 3,
                "y": -1,
                "z": -2
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 22,
            "richness": "POOR",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 3,
                "y": 0,
                "z": -3
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 23,
            "richness": "POOR",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 2,
                "y": 1,
                "z": -3
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 24,
            "richness": "POOR",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 1,
                "y": 2,
                "z": -3
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 25,
            "richness": "POOR",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 0,
                "y": 3,
                "z": -3
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 26,
            "richness": "POOR",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": -1,
                "y": 3,
                "z": -2
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 27,
            "richness": "POOR",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": -2,
                "y": 3,
                "z": -1
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 28,
            "richness": "POOR",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": -3,
                "y": 3,
                "z": 0
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 29,
            "richness": "POOR",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": -3,
                "y": 2,
                "z": 1
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 30,
            "richness": "POOR",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": -3,
                "y": 1,
                "z": 2
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 31,
            "richness": "POOR",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": -3,
                "y": 0,
                "z": 3
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 32,
            "richness": "POOR",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": -2,
                "y": -1,
                "z": 3
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 33,
            "richness": "POOR",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": -1,
                "y": -2,
                "z": 3
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 34,
            "richness": "POOR",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 0,
                "y": -3,
                "z": 3
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 35,
            "richness": "POOR",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 1,
                "y": -3,
                "z": 2
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        },
        {
            "index": 36,
            "richness": "POOR",
            "coord": {
                "directions": [
                    [
                        1,
                        -1,
                        0
                    ],
                    [
                        1,
                        0,
                        -1
                    ],
                    [
                        0,
                        1,
                        -1
                    ],
                    [
                        -1,
                        1,
                        0
                    ],
                    [
                        -1,
                        0,
                        1
                    ],
                    [
                        0,
                        -1,
                        1
                    ]
                ],
                "x": 2,
                "y": -3,
                "z": 1
            },
            "tree": {
                "treeSize": 0, // Добавлено: Размер дерева, 0 - нет дерева, 1 - маленькое, 2 - среднее, 3 - большое
                "owner": null
             } // Добавлено: Владелец дерева, пока может быть null, 'player1' или 'player2'
        }
    ];


export default hexagonsData;
